MyHome/src/Documents/мх_ВозвратРасходов/мх_ВозвратРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_ВозвратРасходов</name>
  <basedOn>Document.мх_РегистрацияРасходов</basedOn>
  <registerRecords>AccumulationRegister.мх_ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_Расходы</registerRecords>
  <registerRecords>AccumulationRegister.мх_ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасхода</name>
    <type>
      <types>DocumentRef.мх_РегистрацияРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.мх_КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.мх_СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасхода</name>
      <type>
        <types>DocumentRef.мх_РегистрацияРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/мх_ВозвратРасходов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.мх_ВозвратРасходов.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.мх_ВозвратРасходов.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);
	Документы.мх_ВозвратРасходов.ОтразитьДвиженияДоходыРасходы(ЭтотОбъект, Отказ);
	Документы.мх_ВозвратРасходов.ОтразитьДвиженияРасходы(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.мх_РегистрацияРасходов") Тогда
		ЗаполнитьПоДокументуРасхода(ДанныеЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти()
	
	ЭтотОбъект.Сумма = Расходы.Итог("Сумма");
	
	ДокументыРасхода = ЭтотОбъект.Расходы.Выгрузить();
	ДокументыРасхода.Свернуть("ДокументРасхода");
	
	Если ДокументыРасхода.Количество() = 1 Тогда
		ЭтотОбъект.ДокументРасхода = ДокументыРасхода[0].ДокументРасхода;
	Иначе
		ЭтотОбъект.ДокументРасхода = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуРасхода(ДокументРасхода)
	
	ТаблицаРасходов = Документы.мх_ВозвратРасходов.ТаблицаРасходовПоДокументамРасхода(ДокументРасхода);
	
	ЭтотОбъект.Расходы.Загрузить(ТаблицаРасходов);
	
	ДатаОперации = ОбщегоНазначения.ТекущаяДатаПользователя();
	Для каждого СтрокаТаблицы Из ЭтотОбъект.Расходы Цикл
		СтрокаТаблицы.ДатаОперации = ДатаОперации; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
